<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class lessonSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('lessons')->insert([
            [
                'title' => 'علوم اول ابتدایی',
                'unit_id' => 1,
                'book_id' => 4
            ],
            [
                'title' => 'فارسی اول ابتدایی',
                'unit_id' => 1,
                'book_id' => 8
            ],
            [
                'title' => 'ریاضی اول ابتدایی',
                'unit_id' => 1,
                'book_id' => 1
            ],
            [
                'title' => 'نگارش اول ابتدایی',
                'unit_id' => 1,
                'book_id' => 9
            ],
            // 2
            [
                'title' => 'علوم دوم ابتدایی',
                'unit_id' => 2,
                'book_id' => 4
            ],
            [
                'title' => 'فارسی دوم ابتدایی',
                'unit_id' => 2,
                'book_id' => 8
            ],
            [
                'title' => 'ریاضی دوم ابتدایی',
                'unit_id' => 2,
                'book_id' => 1
            ],
            [
                'title' => 'نگارش دوم ابتدایی',
                'unit_id' => 2,
                'book_id' => 9
            ],
            [
                'title' => 'هدیه های آسمان دوم ابتدایی',
                'unit_id' => 2,
                'book_id' => 10
            ],
            // 3
            [
                'title' => 'علوم سوم ابتدایی',
                'unit_id' => 3,
                'book_id' => 4
            ],
            [
                'title' => 'فارسی سوم ابتدایی',
                'unit_id' => 3,
                'book_id' => 8
            ],
            [
                'title' => 'ریاضی سوم ابتدایی',
                'unit_id' => 3,
                'book_id' => 1
            ],
            [
                'title' => 'نگارش سوم ابتدایی',
                'unit_id' => 3,
                'book_id' => 9
            ],
            [
                'title' => 'هدیه های آسمان سوم ابتدایی',
                'unit_id' => 3,
                'book_id' => 10
            ],
            [
                'title' => ' مطالعات اجتماعی سوم ابتدایی',
                'unit_id' => 3,
                'book_id' => 11
            ],
            //   4
            [
                'title' => 'علوم چهارم ابتدایی',
                'unit_id' => 4,
                'book_id' => 4
            ],
            [
                'title' => 'فارسی چهارم ابتدایی',
                'unit_id' => 4,
                'book_id' => 8
            ],
            [
                'title' => 'ریاضی چهارم ابتدایی',
                'unit_id' => 4,
                'book_id' => 1
            ],
            [
                'title' => 'نگارش چهارم ابتدایی',
                'unit_id' => 4,
                'book_id' => 9
            ],
            [
                'title' => 'هدیه های آسمان چهارم ابتدایی',
                'unit_id' => 4,
                'book_id' => 10
            ],
            [
                'title' => ' مطالعات اجتماعی چهارم ابتدایی',
                'unit_id' => 4,
                'book_id' => 11
            ],

            //   5
            [
                'title' => 'علوم پنجم ابتدایی',
                'unit_id' => 5,
                'book_id' => 4
            ],
            [
                'title' => 'فارسی پنجم ابتدایی',
                'unit_id' => 5,
                'book_id' => 8
            ],
            [
                'title' => 'ریاضی پنجم ابتدایی',
                'unit_id' => 5,
                'book_id' => 1
            ],
            [
                'title' => 'نگارش پنجم ابتدایی',
                'unit_id' => 5,
                'book_id' => 9
            ],
            [
                'title' => 'هدیه های آسمان پنجم ابتدایی',
                'unit_id' => 5,
                'book_id' => 10
            ],
            [
                'title' => ' مطالعات اجتماعی پنجم ابتدایی',
                'unit_id' => 5,
                'book_id' => 11
            ],

            //   6
            [
                'title' => 'علوم ششم ابتدایی',
                'unit_id' => 6,
                'book_id' => 4
            ],
            [
                'title' => 'فارسی ششم ابتدایی',
                'unit_id' => 6,
                'book_id' => 8
            ],
            [
                'title' => 'ریاضی ششم ابتدایی',
                'unit_id' => 6,
                'book_id' => 1
            ],
            [
                'title' => 'نگارش ششم ابتدایی',
                'unit_id' => 6,
                'book_id' => 9
            ],
            [
                'title' => 'هدیه های آسمان ششم ابتدایی',
                'unit_id' => 6,
                'book_id' => 10
            ],
            [
                'title' => ' مطالعات اجتماعی ششم ابتدایی',
                'unit_id' => 6,
                'book_id' => 11
            ],
            [
                'title' => ' کار و فناوری ششم ابتدایی',
                'unit_id' => 6,
                'book_id' => 13
            ],

            // high school
            //   7
            [
                'title' => 'ریاضی هفتم دبیرستان ',
                'unit_id' => 7,
                'book_id' => 1
            ],
            [
                'title' => 'علوم هفتم دبیرستان',
                'unit_id' => 7,
                'book_id' => 4
            ],
            [
                'title' => 'عربی هفتم دبیرستان',
                'unit_id' => 7,
                'book_id' => 6
            ],
            [
                'title' => ' انگلیسی هفتم دبیرستان',
                'unit_id' => 7,
                'book_id' => 7
            ],
            [
                'title' => ' فارسی هفتم دبیرستان',
                'unit_id' => 7,
                'book_id' => 8
            ],
            [
                'title' => ' نگارش هفتم دبیرستان ',
                'unit_id' => 7,
                'book_id' => 9
            ],
            [
                'title' => 'مطالعات اجتماعی هفتم دبیرستان',
                'unit_id' => 7,
                'book_id' => 11
            ],
            [
                'title' => ' کار و فناوری هفتم دبیرستان',
                'unit_id' => 7,
                'book_id' => 13
            ],
            [
                'title' => ' پیام های آسمان هفتم دبیرستان',
                'unit_id' => 7,
                'book_id' => 10
            ],
            // 8
            [
                'title' => 'ریاضی هشتم دبیرستان ',
                'unit_id' => 8,
                'book_id' => 1
            ],
            [
                'title' => 'علوم هشتم دبیرستان',
                'unit_id' => 8,
                'book_id' => 4
            ],
            [
                'title' => 'عربی هشتم دبیرستان',
                'unit_id' => 8,
                'book_id' => 6
            ],
            [
                'title' => ' انگلیسی هشتم دبیرستان',
                'unit_id' => 8,
                'book_id' => 7
            ],
            [
                'title' => ' فارسی هشتم دبیرستان',
                'unit_id' => 8,
                'book_id' => 8
            ],
            [
                'title' => ' نگارش هشتم دبیرستان ',
                'unit_id' => 8,
                'book_id' => 9
            ],
            [
                'title' => 'مطالعات اجتماعی هشتم دبیرستان',
                'unit_id' => 8,
                'book_id' => 11
            ],
            [
                'title' => ' کار و فناوری هشتم دبیرستان',
                'unit_id' => 8,
                'book_id' => 13
            ],
            [
                'title' => ' پیام های آسمان هشتم دبیرستان',
                'unit_id' => 8,
                'book_id' => 10
            ],

            // 9
            [
                'title' => 'ریاضی نهم دبیرستان ',
                'unit_id' => 9,
                'book_id' => 1
            ],
            [
                'title' => 'علوم نهم دبیرستان',
                'unit_id' => 9,
                'book_id' => 4
            ],
            [
                'title' => 'عربی نهم دبیرستان',
                'unit_id' => 9,
                'book_id' => 6
            ],
            [
                'title' => ' انگلیسی نهم دبیرستان',
                'unit_id' => 9,
                'book_id' => 7
            ],
            [
                'title' => ' فارسی نهم دبیرستان',
                'unit_id' => 9,
                'book_id' => 8
            ],
            [
                'title' => ' نگارش نهم دبیرستان ',
                'unit_id' => 9,
                'book_id' => 9
            ],
            [
                'title' => 'مطالعات اجتماعی نهم دبیرستان',
                'unit_id' => 9,
                'book_id' => 11
            ],
            [
                'title' => ' کار و فناوری نهم دبیرستان',
                'unit_id' => 9,
                'book_id' => 13
            ],
            [
                'title' => ' پیام های آسمان نهم دبیرستان',
                'unit_id' => 9,
                'book_id' => 10
            ],


            // 10
            [
                'title' => 'ریاضی دهم رشته ریاضی',
                'unit_id' => 10,
                'book_id' => 1
            ],
            [
                'title' => ' فیزیک دهم رشته ریاضی',
                'unit_id' => 10,
                'book_id' => 2
            ],
            [
                'title' => ' هندسه دهم رشته ریاضی',
                'unit_id' => 10,
                'book_id' => 1
            ],
            [
                'title' => 'شیمی دهم رشته ریاضی',
                'unit_id' => 10,
                'book_id' => 3
            ],
            [
                'title' => 'فارسی دهم رشته ریاضی',
                'unit_id' => 10,
                'book_id' => 8
            ],
            [
                'title' => 'نگارش دهم رشته ریاضی',
                'unit_id' => 10,
                'book_id' => 9
            ],
            [
                'title' => 'عربی دهم رشته ریاضی',
                'unit_id' => 10,
                'book_id' => 6
            ],
            [
                'title' => 'انگلیسی دهم رشته ریاضی ',
                'unit_id' => 10,
                'book_id' => 7
            ],
            [
                'title' => 'دین و زندگی دهم رشته ریاضی',
                'unit_id' => 10,
                'book_id' => 10
            ],
            [
                'title' => 'جغرافیا دهم رشته ریاضی',
                'unit_id' => 10,
                'book_id' => 16
            ],


            // 11
            [
                'title' => 'حسابان یازدهم رشته ریاضی',
                'unit_id' => 11,
                'book_id' => 1
            ],
            [
                'title' => 'فیزیک یازدهم رشته ریاضی',
                'unit_id' => 11,
                'book_id' => 2
            ],
            [
                'title' => ' هندسه یازدهم رشته ریاضی',
                'unit_id' => 11,
                'book_id' => 1
            ],
            [
                'title' => 'آمار و احتمال یازدهم رشته ریاضی',
                'unit_id' => 11,
                'book_id' => 1
            ],
            [
                'title' => 'شیمی یازدهم رشته ریاضی',
                'unit_id' => 11,
                'book_id' => 3
            ],
            [
                'title' => ' فارسی یازدهم رشته ریاضی',
                'unit_id' => 11,
                'book_id' => 8
            ],
            [
                'title' => 'نگارش یازدهم رشته ریاضی',
                'unit_id' => 11,
                'book_id' => 9
            ],
            [
                'title' => 'عربی یازدهم رشته ریاضی',
                'unit_id' => 11,
                'book_id' => 6
            ],
            [
                'title' => ' انگلیسی یازدهم رشته ریاضی',
                'unit_id' => 11,
                'book_id' => 7
            ],
            [
                'title' => ' تاریخ یازدهم دهم رشته ریاضی',
                'unit_id' => 11,
                'book_id' => 15
            ],
            [
                'title' => ' زمین شناسی یازدهم رشته ریاضی',
                'unit_id' => 11,
                'book_id' => 18
            ],

            // 12  math
            [
                'title' => 'حسابان دوازدهم رشته ریاضی',
                'unit_id' => 12,
                'book_id' => 1
            ],
            [
                'title' => 'فیزیک دوازدهم رشته ریاضی',
                'unit_id' => 12,
                'book_id' => 2
            ],
            [
                'title' => ' هندسه دوازدهم رشته ریاضی',
                'unit_id' => 12,
                'book_id' => 1
            ],
            [
                'title' => ' گسسته دوازدهم رشته ریاضی',
                'unit_id' => 12,
                'book_id' => 1
            ],
            [
                'title' => 'شیمی دوازدهم رشته ریاضی',
                'unit_id' => 12,
                'book_id' => 3
            ],
            [
                'title' => ' فارسی دوازدهم رشته ریاضی',
                'unit_id' => 12,
                'book_id' => 8
            ],
            [
                'title' => 'نگارش دوازدهم رشته ریاضی',
                'unit_id' => 12,
                'book_id' => 9
            ],
            [
                'title' => 'عربی دوازدهم رشته ریاضی',
                'unit_id' => 12,
                'book_id' => 6
            ],
            [
                'title' => ' انگلیسی دوازدهم رشته ریاضی',
                'unit_id' => 12,
                'book_id' => 7
            ],

            // 10 Science
            [
                'title' => 'ریاضی دهم رشته تجربی',
                'unit_id' => 13,
                'book_id' => 1
            ],
            [
                'title' => ' فیزیک دهم رشته تجربی',
                'unit_id' => 13,
                'book_id' => 2
            ],
            [
                'title' => ' زیست دهم رشته تجربی',
                'unit_id' => 13,
                'book_id' => 5
            ],
            [
                'title' => 'شیمی دهم رشته تجربی',
                'unit_id' => 13,
                'book_id' => 3
            ],
            [
                'title' => 'فارسی دهم رشته تجربی',
                'unit_id' => 13,
                'book_id' => 8
            ],
            [
                'title' => 'نگارش دهم رشته تجربی',
                'unit_id' => 13,
                'book_id' => 9
            ],
            [
                'title' => 'عربی دهم رشته تجربی',
                'unit_id' => 13,
                'book_id' => 6
            ],
            [
                'title' => 'انگلیسی دهم رشته تجربی ',
                'unit_id' => 13,
                'book_id' => 7
            ],
            [
                'title' => 'دین و زندگی دهم رشته تجربی',
                'unit_id' => 13,
                'book_id' => 10
            ],
            [
                'title' => 'جغرافیا دهم رشته تجربی',
                'unit_id' => 13,
                'book_id' => 16
            ],

            // 11 Science
            [
                'title' => 'ریاضی یازدهم رشته تجربی',
                'unit_id' => 14,
                'book_id' => 1
            ],
            [
                'title' => 'فیزیک یازدهم رشته تجربی',
                'unit_id' => 14,
                'book_id' => 2
            ],
            [
                'title' => ' زیست یازدهم رشته تجربی',
                'unit_id' => 14,
                'book_id' => 5
            ],
            [
                'title' => 'شیمی یازدهم رشته تجربی',
                'unit_id' => 14,
                'book_id' => 3
            ],
            [
                'title' => ' فارسی یازدهم رشته تجربی',
                'unit_id' => 14,
                'book_id' => 8
            ],
            [
                'title' => 'نگارش یازدهم رشته تجربی',
                'unit_id' => 14,
                'book_id' => 9
            ],
            [
                'title' => 'عربی یازدهم رشته تجربی',
                'unit_id' => 14,
                'book_id' => 6
            ],
            [
                'title' => ' انگلیسی یازدهم رشته تجربی',
                'unit_id' => 14,
                'book_id' => 7
            ],
            [
                'title' => ' تاریخ یازدهم دهم رشته تجربی',
                'unit_id' => 14,
                'book_id' => 15
            ],
            [
                'title' => ' زمین شناسی یازدهم رشته تجربی',
                'unit_id' => 14,
                'book_id' => 18
            ],

            // 12 Science
            [
                'title' => 'ریاضی دوازدهم رشته تجربی',
                'unit_id' => 15,
                'book_id' => 1
            ],
            [
                'title' => 'فیزیک دوازدهم رشته تجربی',
                'unit_id' => 15,
                'book_id' => 2
            ],
            [
                'title' => ' زیست دوازدهم رشته تجربی',
                'unit_id' => 15,
                'book_id' => 5
            ],
            [
                'title' => 'شیمی دوازدهم رشته تجربی',
                'unit_id' => 15,
                'book_id' => 3
            ],
            [
                'title' => ' فارسی دوازدهم رشته تجربی',
                'unit_id' => 15,
                'book_id' => 8
            ],
            [
                'title' => 'نگارش دوازدهم رشته تجربی',
                'unit_id' => 15,
                'book_id' => 9
            ],
            [
                'title' => 'عربی دوازدهم رشته تجربی',
                'unit_id' => 15,
                'book_id' => 6
            ],
            [
                'title' => ' انگلیسی دوازدهم رشته تجربی',
                'unit_id' => 15,
                'book_id' => 7
            ],
            [
                'title' => ' دین و زندگی دوازدهم رشته تجربی',
                'unit_id' => 15,
                'book_id' => 10
            ],
            [
                'title' => ' تاریخ دوازدهم رشته تجربی',
                'unit_id' => 15,
                'book_id' => 15
            ],


            // 10
            [
                'title' => 'ریاضی و آمار دهم رشته انسانی',
                'unit_id' => 16,
                'book_id' => 1
            ],
            [
                'title' => 'جامعه شناسی دهم رشته انسانی ',
                'unit_id' => 16,
                'book_id' => 19
            ],
            [
                'title' => ' اقتصاد دهم رشته انسانی ',
                'unit_id' => 16,
                'book_id' => 22
            ],
            [
                'title' => 'منطق دهم رشته انسانی ',
                'unit_id' => 16,
                'book_id' => 21
            ],
            [
                'title' => 'علوم و فنون ادبی دهم رشته انسانی',
                'unit_id' => 16,
                'book_id' => 14
            ],
            [
                'title' => 'جغرافیا دهم رشته انسانی',
                'unit_id' => 16,
                'book_id' => 16
            ],
            [
                'title' => 'فارسی دهم رشته انسانی',
                'unit_id' => 16,
                'book_id' => 8
            ],
            [
                'title' => 'نگارش دهم رشته انسانی',
                'unit_id' => 16,
                'book_id' => 9
            ],
            [
                'title' => ' عربی دهم رشته انسانی',
                'unit_id' => 16,
                'book_id' => 6
            ],
            [
                'title' => 'انگلیسی دهم رشته انسانی',
                'unit_id' => 16,
                'book_id' => 7
            ],
            [
                'title' => 'دین و زندگی دهم رشته انسانی',
                'unit_id' => 16,
                'book_id' => 10
            ],
            [
                'title' => 'تاریخ دهم رشته انسانی',
                'unit_id' => 16,
                'book_id' => 15
            ],


            // 11 humanities
            [
                'title' => 'ریاضی و آمار یازدهم رشته انسانی',
                'unit_id' => 17,
                'book_id' => 1
            ],
            [
                'title' => 'جامعه شناسی یازدهم رشته انسانی',
                'unit_id' => 17,
                'book_id' => 19
            ],
            [
                'title' => 'روانشناسی یازدهم رشته انسانی ',
                'unit_id' => 17,
                'book_id' => 20
            ],
            [
                'title' => ' فلسفه یازدهم رشته انسانی',
                'unit_id' => 17,
                'book_id' => 17
            ],
            [
                'title' => 'علوم و فنون ادبی یازدهم رشته انسانی',
                'unit_id' => 17,
                'book_id' => 14
            ],
            [
                'title' => 'جغرافیا یازدهم رشته انسانی',
                'unit_id' => 17,
                'book_id' => 16
            ],
            [
                'title' => 'فارسی یازدهم رشته انسانی',
                'unit_id' => 17,
                'book_id' => 8
            ],
            [
                'title' => 'نگارش یازدهم رشته انسانی',
                'unit_id' => 17,
                'book_id' => 9
            ],
            [
                'title' => ' عربی یازدهم رشته انسانی',
                'unit_id' => 17,
                'book_id' => 6
            ],
            [
                'title' => 'انگلیسی یازدهم رشته انسانی',
                'unit_id' => 17,
                'book_id' => 7
            ],
            [
                'title' => 'دین و زندگی یازدهم رشته انسانی',
                'unit_id' => 17,
                'book_id' => 10
            ],
            [
                'title' => 'تاریخ یازدهم رشته انسانی',
                'unit_id' => 17,
                'book_id' => 15
            ],


            // 12 humanities
            [
                'title' => 'ریاضی و آمار دوازدهم رشته انسانی',
                'unit_id' => 18,
                'book_id' => 1
            ],
            [
                'title' => 'جامعه شناسی دوازدهم رشته انسانی',
                'unit_id' => 18,
                'book_id' => 19
            ],
            [
                'title' => 'فلسفه دوازدهم رشته انسانی ',
                'unit_id' => 18,
                'book_id' => 17
            ],
            [
                'title' => ' فلسفه دوازدهم رشته انسانی',
                'unit_id' => 18,
                'book_id' => 17
            ],
            [
                'title' => 'علوم و فنون ادبی دوازدهم رشته انسانی',
                'unit_id' => 18,
                'book_id' => 14
            ],
            [
                'title' => 'جغرافیا دوازدهم رشته انسانی',
                'unit_id' => 18,
                'book_id' => 16
            ],
            [
                'title' => 'فارسی دوازدهم رشته انسانی',
                'unit_id' => 18,
                'book_id' => 8
            ],
            [
                'title' => 'نگارش دوازدهم رشته انسانی',
                'unit_id' => 18,
                'book_id' => 9
            ],
            [
                'title' => ' عربی دوازدهم رشته انسانی',
                'unit_id' => 18,
                'book_id' => 6
            ],
            [
                'title' => 'انگلیسی دوازدهم رشته انسانی',
                'unit_id' => 18,
                'book_id' => 7
            ],
            [
                'title' => 'دین و زندگی دوازدهم رشته انسانی',
                'unit_id' => 18,
                'book_id' => 10
            ],
            [
                'title' => 'تاریخ دوازدهم رشته انسانی',
                'unit_id' => 18,
                'book_id' => 15
            ],


        ]);
    }
}
