<?php

namespace Database\Seeders;

use App\Models\University;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class universitiesSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('universities')->insert([
            [
                'title'=>'دانشگاه اراک	'
            ],
            [
                'title'=>'دانشگاه اردکان'
            ],
            [
                'title'=>'دانشگاه ارومیه'
            ],
            [
                'title'=>'دانشگاه اصفهان'
            ],
            [
                'title'=>'دانشگاه الزهرا'
            ],
            [
                'title'=>'دانشگاه ایلام	'
            ],
            [
                'title'=>'دانشگاه بجنورد'
            ],
            [
                'title'=>'دانشگاه بزرگمهر'
            ],
            [
                'title'=>'دانشگاه بناب'
            ],
            [
                'title'=>'دانشگاه بوعلی سینا همدان'
            ],
            [
                'title'=>'دانشگاه بیرجند'
            ],
            [
                'title'=>'دانشگاه بین‌المللی امام خمینی	'
            ],
            [
                'title'=>'دانشگاه تبریز	'
            ],
            [
                'title'=>'دانشگاه تحصیلات تکمیلی صنعتی کرمان	'
            ],
            [
                'title'=>'دانشگاه تحصیلات تکمیلی علوم پایه زنجان	'
            ],
            [
                'title'=>'دانشگاه تخصصی فناوری‌های نوین آمل	'
            ],
            [
                'title'=>'دانشگاه تربت حیدریه'
            ],
            [
                'title'=>'دانشگاه تربیت دبیر شهید رجایی	'
            ],
            [
                'title'=>'دانشگاه تربیت مدرس'
            ],
            [
                'title'=>'دانشگاه تفرش	'
            ],
            [
                'title'=>'دانشگاه تهران	'
            ],
            [
                'title'=>'دانشگاه جیرفت	'
            ],
            [
                'title'=>'دانشگاه جهرم'
            ],
            [
                'title'=>'دانشگاه حضرت نرجس رفسنجان	'
            ],
            [
                'title'=>'دانشگاه حکیم سبزواری	'
            ],
            [
                'title'=>'دانشگاه خلیج فارس بوشهر	'
            ],
            [
                'title'=>'دانشگاه خوارزمی	'
            ],
            [
                'title'=>'دانشگاه دامغان'
            ],
            [
                'title'=>'دانشگاه حضرت معصومه	'
            ],
            [
                'title'=>'دانشگاه دریانوردی و علوم دریایی چابهار'
            ],
            [
                'title'=>'دانشگاه رازی کرمانشاه	'
            ],
            [
                'title'=>'دانشگاه زابل'
            ],
            [
                'title'=>'دانشگاه زنجان	'
            ],
            [
                'title'=>'دانشگاه سلمان فارسی کازرون'
            ],
            [
                'title'=>'دانشگاه سید جمال‌الدین اسدآبادی'
            ],
            [
                'title'=>'دانشگاه سمنان	'
            ],
            [
                'title'=>'دانشگاه سیستان و بلوچستان	'
            ],
            [
                'title'=>'دانشگاه شاهد	'
            ],
            [
                'title'=>'دانشگاه شهرکرد'
            ],
            [
                'title'=>'دانشگاه شهید باهنر کرمان	'
            ],
            [
                'title'=>'دانشگاه شهید بهشتی'
            ],
            [
                'title'=>'دانشگاه شهید چمران اهواز	'
            ],
            [
                'title'=>'دانشگاه شهید مدنی آذربایجان	'
            ],
            [
                'title'=>'دانشگاه شیراز	'
            ],

        ]);

    }
}
